# Lectura de Archivos de Datos
Primeramente obtenemos los archivos .csv mencionados como parte de la actividad. Se usarán más adelante puesto que el comando para leerlos se introduce mucho después del inicio.

In [2]:
avgtemp2018 = pd.read_csv('avgtemp2018.csv', usecols = (4,5), encoding='latin-1')
rains2018 = pd.read_csv('rain2018.csv', usecols = (4,5), encoding='latin-1')

avgtemp2019 = pd.read_csv('avgtemp2019.csv', usecols = (4,5), encoding='latin-1')
rains2019 = pd.read_csv('rain2019.csv', usecols = (4,5), encoding='latin-1')

# Data Manipulation with Pandas
Importación y revisión de versión:

In [3]:
import pandas
pandas.__version__

'0.23.4'

In [3]:
import pandas as pd
pd?

In [4]:
import numpy as np

# Series as generalized numpy array

In [8]:
data = pd.Series([0.25, 0.5, 0.75, 1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [9]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [10]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
data2 = pd.Series([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
data2

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [12]:
data2.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [13]:
data2.index

RangeIndex(start=0, stop=11, step=1)

In [14]:
data[0]

0.25

In [15]:
data2[4]

4

In [19]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [20]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [21]:
data['a']

0.25

In [22]:
data['b']

0.5

In [23]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [25]:
data[2]

0.25

# Series as specialized dictionary

In [52]:
tempDictionary = {'Aguascalientes': 14.02,
        'Baja California': 16.69,
        'Campeche': 23.37,
        'Chihuahua': 11.68,
        'Durango': 11.84}
temp = pd.Series(tempDictionary)
temp

Aguascalientes     14.02
Baja California    16.69
Campeche           23.37
Chihuahua          11.68
Durango            11.84
dtype: float64

In [53]:
temp['Aguascalientes']

14.02

In [57]:
temp['Aguascalientes':'Durango']

Aguascalientes     14.02
Baja California    16.69
Campeche           23.37
Chihuahua          11.68
Durango            11.84
dtype: float64

# Constructing Series Objects
Hay diversas maneras de construir un objeto Series:

In [44]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [45]:
pd.Series('repeat', index = [100, 200, 300])

100    repeat
200    repeat
300    repeat
dtype: object

In [46]:
pd.Series({'a':1, 'b':2, 'c':3})

a    1
b    2
c    3
dtype: int64

In [50]:
pd.Series({'a':1, 'b':2, 'c':3}, index = ['b', 'c', 'a'])

b    2
c    3
a    1
dtype: int64

# The Pandas DataFrame Object

In [59]:
rainDict = {'Aguascalientes': 6.61, 'Baja California': 18.82, 'Campeche': 54, 'Chihuahua': 20, 'Durango': 1.81}
rain = pd.Series(rainDict)
rain

Aguascalientes      6.61
Baja California    18.82
Campeche           54.00
Chihuahua          20.00
Durango             1.81
dtype: float64

In [60]:
states = pd.DataFrame({'Rain': rain, 'Temperature': temp})
states

                  Rain  Temperature
Aguascalientes    6.61        14.02
Baja California  18.82        16.69
Campeche         54.00        23.37
Chihuahua        20.00        11.68
Durango           1.81        11.84

In [61]:
states.index

Index(['Aguascalientes', 'Baja California', 'Campeche', 'Chihuahua',
       'Durango'],
      dtype='object')

In [62]:
states.columns

Index(['Rain', 'Temperature'], dtype='object')

# DataFrame as a Specialized Dictionary

In [63]:
states['Rain']

Aguascalientes      6.61
Baja California    18.82
Campeche           54.00
Chihuahua          20.00
Durango             1.81
Name: Rain, dtype: float64

# Constructing DataFrame Objects
Existen distintas formas de construir un objeto DataFrame:

In [65]:
pd.DataFrame(rain, columns = ['Rain'])

                  Rain
Aguascalientes    6.61
Baja California  18.82
Campeche         54.00
Chihuahua        20.00
Durango           1.81

In [68]:
data = [{'a': i - 2, 'b': i * i - 1}
        for i in range(4)]
pd.DataFrame(data)

   a  b
0 -2 -1
1 -1  0
2  0  3
3  1  8

In [69]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [70]:
pd.DataFrame({'Rain': rain, 'Temperature': temp})

                  Rain  Temperature
Aguascalientes    6.61        14.02
Baja California  18.82        16.69
Campeche         54.00        23.37
Chihuahua        20.00        11.68
Durango           1.81        11.84

In [73]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['Cool Column', 'Cooler Column'])

   Cool Column  Cooler Column
0     0.859937       0.115785
1     0.095570       0.289857
2     0.875592       0.222268

In [75]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['Cool Column', 'Cooler Column'],
             index=['A', 'B', 'C'])

   Cool Column  Cooler Column
A     0.672540       0.429434
B     0.133868       0.499931
C     0.914388       0.128717

In [81]:
A = np.zeros(4, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.), (0, 0.)],
      dtype=[('A', '<i8'), ('B', '<f8')])

In [82]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0
3  0  0.0

# The Pandas Index Object

In [85]:
i = pd.Index([1, 2, 3, 4, 5])
i

Int64Index([1, 2, 3, 4, 5], dtype='int64')

# Index as immutable array

In [86]:
i[0]

1

In [88]:
i[4]

5

In [94]:
i[::2]

Int64Index([1, 3, 5], dtype='int64')

In [95]:
i[::3]

Int64Index([1, 4], dtype='int64')

In [96]:
print(i.size, i.shape, i.ndim, i.dtype)

5 (5,) 1 int64

La diferencia entre un objeto _Index_ y los arreglos de NumPy es que los índices son inmutables, por lo cual no es válida la sentencia (por ejemplo):

i[0] = 3

# Index as ordered set

In [102]:
indA = pd.Index([1, 3, 5, 7, 9, 10])
indB = pd.Index([2, 3, 5, 7, 11])

In [103]:
#Intersección
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [104]:
#Unión
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 10, 11], dtype='int64')

In [105]:
#Diferencia Simétrica
indA ^ indB

Int64Index([1, 2, 9, 10, 11], dtype='int64')

# Data Indexing and Selection
Data selection in Series: Series as dictionary

In [106]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [107]:
data['a']

0.25

In [108]:
data['c']

0.75

In [109]:
'a' in data

True

In [110]:
'k' in data

False

In [112]:
0.25 in data

False

In [113]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [118]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [122]:
data['e'] = 1.25
data['f'] = 1.5
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
f    1.50
dtype: float64

# Series as one-dimensional array

In [123]:
#Slicing
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [124]:
data['c':'f']

c    0.75
d    1.00
e    1.25
f    1.50
dtype: float64

In [125]:
data[0:5]

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [126]:
#Masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [127]:
data[(data > 0)]

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
f    1.50
dtype: float64

In [128]:
data[(data > 0.5) & (data < 1)]

c    0.75
dtype: float64

In [130]:
#Fancy indexing
data[['a', 'b', 'c', 'f']]

a    0.25
b    0.50
c    0.75
f    1.50
dtype: float64

In [133]:
rains2019[0:10]

                        NOMBRE    ENE
0         Aguascalientes, Ags.   6.61
1  Cincuenta Aniversario, Ags.  10.60
2            San Bartolo, Ags.  10.50
3          Calvillo, Ags. SMN*  18.17
4            La Codorniz, Ags.  16.70
5           Cañada Honda, Ags.  17.30
6               Calvillo, Ags.   9.20
7              Los Conos, Ags.  13.20
8                  Cosío, Ags.   7.20
9                Jocoque, Ags.   6.30

In [143]:
rains2019[(rains2019['ENE'] > 5) & (rains2019['ENE'] < 10)]

                                           NOMBRE   ENE
0                            Aguascalientes, Ags.  6.61
6                                  Calvillo, Ags.  9.20
8                                     Cosío, Ags.  7.20
9                                   Jocoque, Ags.  6.30
11                               El Niagara, Ags.  5.51
13           Observatorio de Aguascalientes, Ags.  8.71
16                                 Pabellón, Ags.  6.80
17                    Plutarco Elías Calles, Ags.  6.00
20                               Sandovales, Ags.  6.00
29                         Ejido Nuevo León, B.C.  8.90
31                                 Mexicali, B.C.  9.31
37                             Díaz Ordaz, B.C.S.  6.40
38                         Guerrero Negro, B.C.S.  8.00
39                           Los Barriles, B.C.S.  8.01
52                               Santiago, B.C.S.  9.21
57                               El Carmen, Camp.  7.41
68                              Noh-Yaxché, Camp.  6.10
71                                Sabancuy, Camp.  8.00
84                                 La Mesa, Chih.  6.72
85                           Casas Grandes, Chih.  5.30
88                               Chihuahua, Chih.  6.40
90                   Colina (hidrométrica), Chih.  8.01
91                       Ing. Andrew Weiss, Chih.  7.50
93                                El Rejón, Chih.  6.40
99                                 Jiménez, Chih.  7.40
102                      Ing. Luis L. León, Chih.  7.51
105                        Pico del Águila, Chih.  6.02
106         Presa Francisco I. Madero, Chih. SGT*  7.25
108              Observatorio de Chihuahua, Chih.  6.41
111                             Temósachic, Chih.  8.36
...                                           ...   ...
969                              El Oregano, Son.  9.11
973                         Punta de Agua 2, Son.  8.82
979                                 Tepache, Son.  6.51
981                                   Vícam, Son.  9.50
1018                         La Encantada, Tamps.  8.60
1020                    San Fernando, Tamps. SMN*  7.37
1035                    Nuevo Laredo, Tamps. SGT*  8.50
1036                         Nuevo Laredo, Tamps.  8.60
1037                         Padilla, Tamps. SGT*  8.40
1038                              Padilla, Tamps.  8.40
1108                                 Ídolos, Ver.  6.14
1110                            Jamapa, Ver. SGT*  9.80
1139                                 Perote, Ver.  7.09
1166                           Villa Tejeda, Ver.  9.60
1199                               Atolinga, Zac.  9.72
1203                            El Cazadero, Zac.  7.51
1204                           El Saladillo, Zac.  6.02
1207                              Guadalupe, Zac.  8.01
1208                          Genaro Codina, Zac.  6.02
1209                            Juan Aldama, Zac.  5.62
1210                              Juchipila, Zac.  9.40
1211                                  Jerez, Zac.  6.60
1212                                La Bufa, Zac.  7.70
1217            Gobernador Leobardo Reynoso, Zac.  8.00
1219                         Monte Escobedo, Zac.  6.02
1222                                Palomas, Zac.  9.80
1226                          San Francisco, Zac.  9.70
1229  Santa Teresa (Independencia Nacional), Zac.  6.00
1236                           Villa de Cos, Zac.  7.00
1238                          Villa Hidalgo, Zac.  9.70

[188 rows x 2 columns]

# Indexers: loc, iloc and ix

In [142]:
rains2019['ENE']

0        6.61
1       10.60
2       10.50
3       18.17
4       16.70
5       17.30
6        9.20
7       13.20
8        7.20
9        6.30
10      24.30
11       5.51
12      15.50
13       8.71
14      10.40
15      11.00
16       6.80
17       6.00
18      11.53
19      17.41
20       6.00
21      11.00
22      22.20
23      18.82
24      48.20
25      11.31
26      58.70
27      20.60
28      48.42
29       8.90
        ...
1211     6.60
1212     7.70
1213     2.51
1214    20.80
1215    13.50
1216    13.61
1217     8.00
1218    22.02
1219     6.02
1220    29.70
1221     4.80
1222     9.80
1223     3.50
1224    15.70
1225     3.61
1226     9.70
1227     5.00
1228     1.60
1229     6.00
1230    18.52
1231    13.50
1232     3.00
1233    30.10
1234    25.01
1235    14.02
1236     7.00
1237    32.32
1238     9.70
1239    15.20
1240    12.02
Name: ENE, Length: 1241, dtype: float64

In [144]:
rains2019[1:3]

                        NOMBRE   ENE
1  Cincuenta Aniversario, Ags.  10.6
2            San Bartolo, Ags.  10.5

In [145]:
rains2019.loc[1]

NOMBRE    Cincuenta Aniversario, Ags.
ENE                              10.6
Name: 1, dtype: object

In [146]:
rains2019.loc[200]

NOMBRE    La Fragua, Coah.
ENE                      0
Name: 200, dtype: object

In [148]:
rains2019.loc[90:100]

                           NOMBRE    ENE
90   Colina (hidrométrica), Chih.   8.01
91       Ing. Andrew Weiss, Chih.   7.50
92                Chinipas, Chih.  44.01
93                El Rejón, Chih.   6.40
94     Francisco I. Madero, Chih.  10.02
95          Guachochi, Chih. SMN*  34.00
96                 Guapoca, Chih.  25.40
97                Guerachi, Chih.  38.40
98             San Ignacio, Chih.  25.00
99                 Jiménez, Chih.   7.40
100            La Boquilla, Chih.  10.51

In [149]:
rains2019.iloc[200]

NOMBRE    La Fragua, Coah.
ENE                      0
Name: 200, dtype: object

In [150]:
rains2019.iloc[90:100]

                          NOMBRE    ENE
90  Colina (hidrométrica), Chih.   8.01
91      Ing. Andrew Weiss, Chih.   7.50
92               Chinipas, Chih.  44.01
93               El Rejón, Chih.   6.40
94    Francisco I. Madero, Chih.  10.02
95         Guachochi, Chih. SMN*  34.00
96                Guapoca, Chih.  25.40
97               Guerachi, Chih.  38.40
98            San Ignacio, Chih.  25.00
99                Jiménez, Chih.   7.40

# Data Selection in DataFrame

In [151]:
rains2019['ENE']

0        6.61
1       10.60
2       10.50
3       18.17
4       16.70
5       17.30
6        9.20
7       13.20
8        7.20
9        6.30
10      24.30
11       5.51
12      15.50
13       8.71
14      10.40
15      11.00
16       6.80
17       6.00
18      11.53
19      17.41
20       6.00
21      11.00
22      22.20
23      18.82
24      48.20
25      11.31
26      58.70
27      20.60
28      48.42
29       8.90
        ...
1211     6.60
1212     7.70
1213     2.51
1214    20.80
1215    13.50
1216    13.61
1217     8.00
1218    22.02
1219     6.02
1220    29.70
1221     4.80
1222     9.80
1223     3.50
1224    15.70
1225     3.61
1226     9.70
1227     5.00
1228     1.60
1229     6.00
1230    18.52
1231    13.50
1232     3.00
1233    30.10
1234    25.01
1235    14.02
1236     7.00
1237    32.32
1238     9.70
1239    15.20
1240    12.02
Name: ENE, Length: 1241, dtype: float64

In [154]:
rains2019['NOMBRE']

0                              Aguascalientes, Ags.
1                       Cincuenta Aniversario, Ags.
2                                 San Bartolo, Ags.
3                               Calvillo, Ags. SMN*
4                                 La Codorniz, Ags.
5                                Cañada Honda, Ags.
6                                    Calvillo, Ags.
7                                   Los Conos, Ags.
8                                       Cosío, Ags.
9                                     Jocoque, Ags.
10                                 Media Luna, Ags.
11                                 El Niagara, Ags.
12                                 El Novillo, Ags.
13             Observatorio de Aguascalientes, Ags.
14           Presa Cincuenta Aniversario, Ags. SMN*
15                                  Palo Alto, Ags.
16                                   Pabellón, Ags.
17                      Plutarco Elías Calles, Ags.
18                    Puerto de la Concepción, Ags.
19                        Derivadora Pabellón, Ags.
20                                 Sandovales, Ags.
21                                La Tinaja 2, Ags.
22                               Villa Juárez, Ags.
23                             Agua Hechicera, B.C.
24                      Abelardo L. Rodríguez, B.C.
25                              Cataviña, B.C. SMN*
26                                 El Carrizo, B.C.
27                                 El Florido, B.C.
28                        Emilio López Zamora, B.C.
29                           Ejido Nuevo León, B.C.
                           ...
1211                                    Jerez, Zac.
1212                                  La Bufa, Zac.
1213                               La Florida, Zac.
1214                             Llano Blanco, Zac.
1215                         Manuel Felgueres, Zac.
1216                                   Loreto, Zac.
1217              Gobernador Leobardo Reynoso, Zac.
1218                        Mezquital del Oro, Zac.
1219                           Monte Escobedo, Zac.
1220                               Nochistlán, Zac.
1221                            Nuevo Tampico, Zac.
1222                                  Palomas, Zac.
1223                              Pino Suárez, Zac.
1224                                Moraleños, Zac.
1225                               Río Grande, Zac.
1226                            San Francisco, Zac.
1227                                 Santiago, Zac.
1228                               Sombrerete, Zac.
1229    Santa Teresa (Independencia Nacional), Zac.
1230                               Santa Rosa, Zac.
1231               Ing. Julián Adame Alatorre, Zac.
1232                            Chalchihuites, Zac.
1233                  Teúl de González Ortega, Zac.
1234                             Tlalchichila, Zac.
1235                              Tlaltenango, Zac.
1236                             Villa de Cos, Zac.
1237                    Villa González Ortega, Zac.
1238                            Villa Hidalgo, Zac.
1239                       José María Morelos, Zac.
1240                                Zacatecas, Zac.
Name: NOMBRE, Length: 1241, dtype: object

In [155]:
avgtemp2019['Tmed']

0      27.441935
1      13.462069
2      28.088710
3      23.374074
4      17.987097
5      14.730357
6      16.614000
7      15.850000
8      24.151613
9      11.682258
10     16.250000
11     23.260000
12     17.741935
13     18.038889
14     14.440323
15     17.670968
16     15.238889
17     12.630645
18     15.437500
19     20.096667
20     27.137097
21     18.395238
22     22.087097
23     23.881034
24     14.698276
25     16.029032
26      8.104839
27     16.546296
28     12.815000
29     23.403846
         ...
605    19.931034
606    19.451613
607    20.338710
608    19.870968
609    19.319355
610    17.080000
611    17.018519
612    16.151786
613    16.050000
614    19.508065
615    23.337931
616    21.467742
617    13.669355
618    16.294828
619    15.079032
620    22.241071
621    20.737500
622    19.508621
623    21.975806
624     7.629032
625    15.000000
626    14.838710
627    22.967742
628    13.532258
629    12.388710
630    15.232258
631    11.161290
632    16.697917
633    22.269231
634    20.870968
Name: Tmed, Length: 635, dtype: float64

In [163]:
avgtemp2019.Tmed

0      27.441935
1      13.462069
2      28.088710
3      23.374074
4      17.987097
5      14.730357
6      16.614000
7      15.850000
8      24.151613
9      11.682258
10     16.250000
11     23.260000
12     17.741935
13     18.038889
14     14.440323
15     17.670968
16     15.238889
17     12.630645
18     15.437500
19     20.096667
20     27.137097
21     18.395238
22     22.087097
23     23.881034
24     14.698276
25     16.029032
26      8.104839
27     16.546296
28     12.815000
29     23.403846
         ...
605    19.931034
606    19.451613
607    20.338710
608    19.870968
609    19.319355
610    17.080000
611    17.018519
612    16.151786
613    16.050000
614    19.508065
615    23.337931
616    21.467742
617    13.669355
618    16.294828
619    15.079032
620    22.241071
621    20.737500
622    19.508621
623    21.975806
624     7.629032
625    15.000000
626    14.838710
627    22.967742
628    13.532258
629    12.388710
630    15.232258
631    11.161290
632    16.697917
633    22.269231
634    20.870968
Name: Tmed, Length: 635, dtype: float64

In [165]:
avgtemp2019.Est

0                                              ACAPULCO
1                                                 ALTAR
2                                               ARRIAGA
3                                              CAMPECHE
4                                      CD. CONSTITUCIÓN
5                                           CD. OBREGON
6                                          CD. VICTORIA
7                                      CENTRAL TACUBAYA
8                                              CHETUMAL
9                                             CHIHUAHUA
10                                        CIUDAD GUZMÁN
11                                        COATZACOALCOS
12                                              COMITAN
13                                           CUERNAVACA
14                                              DURANGO
15                                              EMPALME
16                                           GUANAJUATO
17                                      HGO. DEL PARRAL
18                                               JALAPA
19                                               LA PAZ
20                                           MANZANILLO
21                                              MATLAPA
22                                             MAZATLAN
23                                               MERIDA
24                                             MONCLOVA
25                                              MORELIA
26                                  NUEVO CASAS GRANDES
27                                              ORIZABA
28                                       PIEDRAS NEGRAS
29                                             PROGRESO
                             ...
605                                   Rancho Nuevo Pue.
606                          Sanalona hidrométrica Sin.
607    Bacurato hidrométrica de Gustavo Diaz Ordáz Sin.
608                        El Sabinal hidrométrica Sin.
609                                               CHOIX
610               Presa Plutarco Elías Calles Son. SGT*
611                              Ciudad Victoria Tamps.
612                            Barretal Dos Tamps. SGT*
613                         Cándido Aguilar Tamps. SGT*
614                                          Abalá Yuc.
615                                  Celestún Yuc. SMN*
616                                        Mocochá Yuc.
617                                   Santa Teresa Zac.
618                               Motozintla Chis. SGT*
619                                    CCH Azcapotzalco
620                                  Tierra Morada Ver.
621                                 Siltepec Chis. SGT*
622                                    Ahualulco Tamps.
623                                       Carrizal Ver.
624                                     Bachíniva Chih.
625                                      Gabino Barreda
626                                          Bocas Jal.
627                                Colonia Hidalgo Mex.
628                                  Porfirio Díaz Méx.
629                                       Rectoría Méx.
630                                       CCH Naucalpan
631                          Santa María del Llano Méx.
632                                      Zacatepec Oax.
633                       Naranjal Lerdo de Tejada Ver.
634                                         Conkal Yuc.
Name: Est, Length: 635, dtype: object

In [170]:
avgtemp2019.Est is avgtemp2019['Est']

True

In [171]:
rains2019.ENE is rains2019['ENE']

True

In [176]:
rains2019['Ratio'] = rains2019.ENE / avgtemp2019.Tmed
rains2019['Ratio']

0       0.240872
1       0.787398
2       0.373816
3       0.777357
4       0.928443
5       1.174445
6       0.553750
7       0.832808
8       0.298117
9       0.539279
10      1.495385
11      0.236887
12      0.873636
13      0.482846
14      0.720206
15      0.622490
16      0.446227
17      0.475035
18      0.746883
19      0.866313
20      0.221100
21      0.597981
22      1.005112
23      0.788073
24      3.279296
25      0.705595
26      7.242587
27      1.244992
28      3.778385
29      0.380279
          ...
1211         NaN
1212         NaN
1213         NaN
1214         NaN
1215         NaN
1216         NaN
1217         NaN
1218         NaN
1219         NaN
1220         NaN
1221         NaN
1222         NaN
1223         NaN
1224         NaN
1225         NaN
1226         NaN
1227         NaN
1228         NaN
1229         NaN
1230         NaN
1231         NaN
1232         NaN
1233         NaN
1234         NaN
1235         NaN
1236         NaN
1237         NaN
1238         NaN
1239         NaN
1240         NaN
Name: Ratio, Length: 1241, dtype: float64

In [177]:
rains2019

,NOMBRE,ENE,Rain/Temp Ratio,Ratio
0,"Aguascalientes, Ags.",6.61,0.240872,0.240872
1,"Cincuenta Aniversario, Ags.",10.60,0.787398,0.787398
2,"San Bartolo, Ags.",10.50,0.373816,0.373816
3,"Calvillo, Ags. SMN*",18.17,0.777357,0.777357
4,"La Codorniz, Ags.",16.70,0.928443,0.928443
5,"Cañada Honda, Ags.",17.30,1.174445,1.174445
6,"Calvillo, Ags.",9.20,0.553750,0.553750
7,"Los Conos, Ags.",13.20,0.832808,0.832808
8,"Cosío, Ags.",7.20,0.298117,0.298117
9,"Jocoque, Ags.",6.30,0.539279,0.539279
10,"Media Luna, Ags.",24.30,1.495385,1.495385
11,"El Niagara, Ags.",5.51,0.236887,0.236887
12,"El Novillo, Ags.",15.50,0.873636,0.873636
13,"Observatorio de Aguascalientes, Ags.",8.71,0.482846,0.482846
14,"Presa Cincuenta Aniversario, Ags. SMN*",10.40,0.720206,0.720206
15,"Palo Alto, Ags.",11.00,0.622490,0.622490
16,"Pabellón, Ags.",6.80,0.446227,0.446227
17,"Plutarco Elías Calles, Ags.",6.00,0.475035,0.475035
18,"Puerto de la Concepción, Ags.",11.53,0.746883,0.746883
19,"Derivadora Pabellón, Ags.",17.41,0.866313,0.866313
20,"Sandovales, Ags.",6.00,0.221100,0.221100
21,"La Tinaja 2, Ags.",11.00,0.597981,0.597981
22,"Villa Juárez, Ags.",22.20,1.005112,1.005112
23,"Agua Hechicera, B.C.",18.82,0.788073,0.788073
24,"Abelardo L. Rodríguez, B.C.",48.20,3.279296,3.279296
25,"Cataviña, B.C. SMN*",11.31,0.705595,0.705595
26,"El Carrizo, B.C.",58.70,7.242587,7.242587
27,"El Florido, B.C.",20.60,1.244992,1.244992
28,"Emilio López Zamora, B.C.",48.42,3.778385,3.778385
29,"Ejido Nuevo León, B.C.",8.90,0.380279,0.380279
...,...,...,...,...
1211,"Jerez, Zac.",6.60,NaN,NaN
1212,"La Bufa, Zac.",7.70,NaN,NaN
1213,"La Florida, Zac.",2.51,NaN,NaN
1214,"Llano Blanco, Zac.",20.80,NaN,NaN
1215,"Manuel Felgueres, Zac.",13.50,NaN,NaN
1216,"Loreto, Zac.",13.61,NaN,NaN
1217,"Gobernador Leobardo Reynoso, Zac.",8.00,NaN,NaN
1218,"Mezquital del Oro, Zac.",22.02,NaN,NaN
1219,"Monte Escobedo, Zac.",6.02,NaN,NaN
1220,"Nochistlán, Zac.",29.70,NaN,NaN
1221,"Nuevo Tampico, Zac.",4.80,NaN,NaN
1222,"Palomas, Zac.",9.80,NaN,NaN
1223,"Pino Suárez, Zac.",3.50,NaN,NaN
1224,"Moraleños, Zac.",15.70,NaN,NaN
1225,"Río Grande, Zac.",3.61,NaN,NaN
1226,"San Francisco, Zac.",9.70,NaN,NaN
1227,"Santiago, Zac.",5.00,NaN,NaN
1228,"Sombrerete, Zac.",1.60,NaN,NaN
1229,"Santa Teresa (Independencia Nacional), Zac.",6.00,NaN,NaN
1230,"Santa Rosa, Zac.",18.52,NaN,NaN
1231,"Ing. Julián Adame Alatorre, Zac.",13.50,NaN,NaN
1232,"Chalchihuites, Zac.",3.00,NaN,NaN
1233,"Teúl de González Ortega, Zac.",30.10,NaN,NaN
1234,"Tlalchichila, Zac.",25.01,NaN,NaN
1235,"Tlaltenango, Zac.",14.02,NaN,NaN
1236,"Villa de Cos, Zac.",7.00,NaN,NaN
1237,"Villa González Ortega, Zac.",32.32,NaN,NaN
1238,"Villa Hidalgo, Zac.",9.70,NaN,NaN
1239,"José María Morelos, Zac.",15.20,NaN,NaN
1240,"Zacatecas, Zac.",12.02,NaN,NaN

# DataFrame as two-dimensional array

In [179]:
rains2018.values

array([['Aguascalientes, Ags.', 25.8],
       ['Cincuenta Aniversario, Ags.', 58.6],
       ['Calvillo, Ags. SMN*', 56.0],
       ...,
       ['Coyuca de Catalán', 0.4],
       ['Zihuatanejo de Azueta', 2.2],
       ['Zimapán', 9.8]], dtype=object)

In [180]:
rains2018.T

,0,1,2,3,4,5,6,7,8,9,...,1874,1875,1876,1877,1878,1879,1880,1881,1882,1883
NOMBRE,"Aguascalientes, Ags.","Cincuenta Aniversario, Ags.","Calvillo, Ags. SMN*","La Codorniz, Ags.","Cañada Honda, Ags.","Calvillito, Ags.","Los Conos, Ags.","Cosio, Ags.","Media Luna, Ags.","El Niagara, Ags.",...,Villa de Ramos,Guadalupe,Zacatecas,Zacatepec,Zacualtipán de Ángeles,Zapotlán de Juárez,Ocoyoacac,Coyuca de Catalán,Zihuatanejo de Azueta,Zimapán
ENE,25.8,58.6,56,50,17.2,13.5,51.5,35.5,48.9,25.4,...,3.6,42.5,21.4,0,94.4,4.4,20.4,0.4,2.2,9.8

In [182]:
rains2018.values[0]

array(['Aguascalientes, Ags.', 25.8], dtype=object)

In [183]:
rains2018['ENE']

0        25.8
1        58.6
2        56.0
3        50.0
4        17.2
5        13.5
6        51.5
7        35.5
8        48.9
9        25.4
10       20.9
11       57.2
12       19.0
13       22.0
14       50.0
15       26.7
16       52.8
17        8.0
18       10.0
19       16.9
20        1.4
21       53.6
22        0.5
23       47.6
24       44.6
25       24.0
26        7.6
27        0.0
28       35.9
29        0.0
        ...
1854      0.0
1855     24.3
1856      0.5
1857      5.8
1858      0.0
1859     32.2
1860      0.2
1861     23.2
1862      0.2
1863      3.6
1864     12.4
1865    403.2
1866     15.8
1867     43.8
1868      3.8
1869     10.2
1870    219.4
1871      8.1
1872      0.0
1873     69.6
1874      3.6
1875     42.5
1876     21.4
1877      0.0
1878     94.4
1879      4.4
1880     20.4
1881      0.4
1882      2.2
1883      9.8
Name: ENE, Length: 1884, dtype: float64

In [189]:
rains2018.iloc[:3, :2]

                        NOMBRE   ENE
0         Aguascalientes, Ags.  25.8
1  Cincuenta Aniversario, Ags.  58.6
2          Calvillo, Ags. SMN*  56.0

In [191]:
rains2018.iloc[:5, :1]

                        NOMBRE
0         Aguascalientes, Ags.
1  Cincuenta Aniversario, Ags.
2          Calvillo, Ags. SMN*
3            La Codorniz, Ags.
4           Cañada Honda, Ags.

In [194]:
rains2018.loc[:10, :'ENE']

                         NOMBRE   ENE
0          Aguascalientes, Ags.  25.8
1   Cincuenta Aniversario, Ags.  58.6
2           Calvillo, Ags. SMN*  56.0
3             La Codorniz, Ags.  50.0
4            Cañada Honda, Ags.  17.2
5              Calvillito, Ags.  13.5
6               Los Conos, Ags.  51.5
7                   Cosio, Ags.  35.5
8              Media Luna, Ags.  48.9
9              El Niagara, Ags.  25.4
10           Observatorio, Ags.  20.9

In [195]:
rains2018.ix[:10, :'ENE']

C:\Users\Test\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

                         NOMBRE   ENE
0          Aguascalientes, Ags.  25.8
1   Cincuenta Aniversario, Ags.  58.6
2           Calvillo, Ags. SMN*  56.0
3             La Codorniz, Ags.  50.0
4            Cañada Honda, Ags.  17.2
5              Calvillito, Ags.  13.5
6               Los Conos, Ags.  51.5
7                   Cosio, Ags.  35.5
8              Media Luna, Ags.  48.9
9              El Niagara, Ags.  25.4
10           Observatorio, Ags.  20.9

In [199]:
rains2018.loc[rains2018.ENE > 500]

                          NOMBRE    ENE
173       El Refugio, Chis. SGT*  650.0
176         Salto de Agua, Chis.  582.5
181                       Sayula  818.6
182                   Sayula CFE  704.2
190           San Joaquín, Chis.  569.0
982               Oxolotan, Tab.  513.0
990             Tapijulapa, Tab.  663.3
1097         La Cangrejera, Ver.  600.5
1119  PB3 de la Cangrejera, Ver.  533.3
1120    PB1- La Cangrejera, Ver.  512.5
1766                    Ostuacán  739.1

In [202]:
rains2018.loc[rains2018.ENE > 500, ['NOMBRE', 'ENE']]

                          NOMBRE    ENE
173       El Refugio, Chis. SGT*  650.0
176         Salto de Agua, Chis.  582.5
181                       Sayula  818.6
182                   Sayula CFE  704.2
190           San Joaquín, Chis.  569.0
982               Oxolotan, Tab.  513.0
990             Tapijulapa, Tab.  663.3
1097         La Cangrejera, Ver.  600.5
1119  PB3 de la Cangrejera, Ver.  533.3
1120    PB1- La Cangrejera, Ver.  512.5
1766                    Ostuacán  739.1

In [204]:
rains2018.iloc[0, 1] = 100
rains2018.values[0]

array(['Aguascalientes, Ags.', 100.0], dtype=object)

# Additional Indexing Conventions

In [206]:
rains2018[1:3]

                        NOMBRE   ENE
1  Cincuenta Aniversario, Ags.  58.6
2          Calvillo, Ags. SMN*  56.0

In [208]:
rains2018[rains2018.ENE < 2]

                                NOMBRE  ENE
20       OBSERVATORIO DE ALGODONES SMN  1.4
22                 Cataviña, B.C. SMN*  0.5
27              Ejido Nuevo León, B.C.  0.0
29                     La Misión, B.C.  0.0
30                            MEXICALI  0.0
31                Derivadora MOR, B.C.  1.5
33      OBSERVATORIO DE SAN FELIPE SMN  0.0
34                    San Felipe, B.C.  0.0
35            Cd. Constitución, B.C.S.  0.6
36              Cabo San Lucas, B.C.S.  1.0
37                  Díaz Ordaz, B.C.S.  0.0
38              Guerrero Negro, B.C.S.  0.0
40                      La Paz, B.C.S.  0.9
41                      Loreto, B.C.S.  0.0
42                      Mulege, B.C.S.  0.0
43                  Los Planes, B.C.S.  0.0
44                   La Ribera, B.C.S.  0.5
47           San José del Cabo, B.C.S.  0.0
50               Santa Rosalía, B.C.S.  0.0
51                Todos Santos, B.C.S.  1.0
55           Cayo Arenas, Camp. SEMAR*  1.3
69             Abraham González, Chih.  0.0
70                         BABISAS SMN  0.0
71                    BOCA DEL RIO SMN  0.0
72                 Bassaseachic, Chih.  0.0
73                    Batopilas, Chih.  0.0
74                     Batovira, Chih.  0.0
75                             Peñitas  0.0
76                   Tejolocachi (DGE)  0.0
77                             La Mesa  0.0
...                                ...  ...
1809            Tepelmeme Villa de MOR  0.0
1813                         Tepoztlán  0.2
1814                         Tepoztlán  0.0
1815                           Navojoa  0.1
1822                   Tizapán el Alto  1.8
1823                           Tizimín  0.0
1826              Tlajomulco de Zúñiga  0.2
1827                      Tlalnepantla  0.0
1828                    Tlaquiltenango  0.0
1829             Tlaltizapán de Zapata  0.0
1830                              TLAX  0.4
1831        Heroica Ciudad de Tlaxiaco  0.2
1832                            La Paz  0.0
1834                            Carmen  0.0
1837                             Ahome  1.5
1838                            Mapimí  0.0
1841                            Urique  0.0
1842                        Tepeapulco  0.0
1844                  Tuxtla Gutiérrez  1.6
1848                           Múzquiz  0.0
1850        Pueblo Nuevo Solistahuacán  0.0
1853                            Urique  0.0
1854                            Urique  0.0
1856  San Juan Bautista Valle Nacional  0.5
1858                            Mulegé  0.0
1860                            Juárez  0.2
1862                           Ahumada  0.2
1872                            Yécora  0.0
1877                         Zacatepec  0.0
1881                 Coyuca de Catalán  0.4

[813 rows x 2 columns]

# Operating on Data in Pandas
# Ufuncs: Index Preservation

In [213]:
rainSer2018 = pd.Series(rains2018.ENE[0:10])
rainSer2018.index = rains2018.NOMBRE[0:10]
rainSer2018

NOMBRE
Aguascalientes, Ags.           100.0
Cincuenta Aniversario, Ags.     58.6
Calvillo, Ags. SMN*             56.0
La Codorniz, Ags.               50.0
Cañada Honda, Ags.              17.2
Calvillito, Ags.                13.5
Los Conos, Ags.                 51.5
Cosio, Ags.                     35.5
Media Luna, Ags.                48.9
El Niagara, Ags.                25.4
Name: ENE, dtype: float64

In [216]:
rainSer2019 = pd.Series(rains2019.ENE[0:10])
rainSer2019.index = rains2019.NOMBRE[0:10]
rainSer2019

NOMBRE
Aguascalientes, Ags.            6.61
Cincuenta Aniversario, Ags.    10.60
San Bartolo, Ags.              10.50
Calvillo, Ags. SMN*            18.17
La Codorniz, Ags.              16.70
Cañada Honda, Ags.             17.30
Calvillo, Ags.                  9.20
Los Conos, Ags.                13.20
Cosío, Ags.                     7.20
Jocoque, Ags.                   6.30
Name: ENE, dtype: float64

In [220]:
df = pd.DataFrame({'2018': rainSer2018, '2019': rainSer2019})
df

                              2018   2019
Aguascalientes, Ags.         100.0   6.61
Calvillito, Ags.              13.5    NaN
Calvillo, Ags.                 NaN   9.20
Calvillo, Ags. SMN*           56.0  18.17
Cañada Honda, Ags.            17.2  17.30
Cincuenta Aniversario, Ags.   58.6  10.60
Cosio, Ags.                   35.5    NaN
Cosío, Ags.                    NaN   7.20
El Niagara, Ags.              25.4    NaN
Jocoque, Ags.                  NaN   6.30
La Codorniz, Ags.             50.0  16.70
Los Conos, Ags.               51.5  13.20
Media Luna, Ags.              48.9    NaN
San Bartolo, Ags.              NaN  10.50

In [221]:
np.exp(rainSer2018)

NOMBRE
Aguascalientes, Ags.           2.688117e+43
Cincuenta Aniversario, Ags.    2.816156e+25
Calvillo, Ags. SMN*            2.091659e+24
La Codorniz, Ags.              5.184706e+21
Cañada Honda, Ags.             2.950293e+07
Calvillito, Ags.               7.294164e+05
Los Conos, Ags.                2.323624e+22
Cosio, Ags.                    2.614894e+15
Media Luna, Ags.               1.725839e+21
El Niagara, Ags.               1.074187e+11
Name: ENE, dtype: float64

In [222]:
np.sin(df * np.pi/4)

                                     2018      2019
Aguascalientes, Ags.        -4.910967e-16 -0.887413
Calvillito, Ags.            -9.238795e-01       NaN
Calvillo, Ags.                        NaN  0.809017
Calvillo, Ags. SMN*         -1.714506e-15  0.991100
Cañada Honda, Ags.           8.090170e-01  0.852640
Cincuenta Aniversario, Ags.  8.910065e-01  0.891007
Cosio, Ags.                  3.826834e-01       NaN
Cosío, Ags.                           NaN -0.587785
El Niagara, Ags.             8.910065e-01       NaN
Jocoque, Ags.                         NaN -0.972370
La Codorniz, Ags.            1.000000e+00  0.522499
Los Conos, Ags.              3.826834e-01 -0.809017
Media Luna, Ags.             6.494480e-01       NaN
San Bartolo, Ags.                     NaN  0.923880

# UFuncs: Index Alignment
## Index Alignment in Series

In [223]:
rainSer2018 / rainSer2019

NOMBRE
Aguascalientes, Ags.           15.128593
Calvillito, Ags.                     NaN
Calvillo, Ags.                       NaN
Calvillo, Ags. SMN*             3.082003
Cañada Honda, Ags.              0.994220
Cincuenta Aniversario, Ags.     5.528302
Cosio, Ags.                          NaN
Cosío, Ags.                          NaN
El Niagara, Ags.                     NaN
Jocoque, Ags.                        NaN
La Codorniz, Ags.               2.994012
Los Conos, Ags.                 3.901515
Media Luna, Ags.                     NaN
San Bartolo, Ags.                    NaN
Name: ENE, dtype: float64

In [224]:
rainSer2018.index | rainSer2019.index

Index(['Aguascalientes, Ags.', 'Calvillito, Ags.', 'Calvillo, Ags.',
       'Calvillo, Ags. SMN*', 'Cañada Honda, Ags.',
       'Cincuenta Aniversario, Ags.', 'Cosio, Ags.', 'Cosío, Ags.',
       'El Niagara, Ags.', 'Jocoque, Ags.', 'La Codorniz, Ags.',
       'Los Conos, Ags.', 'Media Luna, Ags.', 'San Bartolo, Ags.'],
      dtype='object', name='NOMBRE')

In [225]:
rainSer2018 + rainSer2019

NOMBRE
Aguascalientes, Ags.           106.61
Calvillito, Ags.                  NaN
Calvillo, Ags.                    NaN
Calvillo, Ags. SMN*             74.17
Cañada Honda, Ags.              34.50
Cincuenta Aniversario, Ags.     69.20
Cosio, Ags.                       NaN
Cosío, Ags.                       NaN
El Niagara, Ags.                  NaN
Jocoque, Ags.                     NaN
La Codorniz, Ags.               66.70
Los Conos, Ags.                 64.70
Media Luna, Ags.                  NaN
San Bartolo, Ags.                 NaN
Name: ENE, dtype: float64

In [226]:
rainSer2018.add(rainSer2019, fill_value = 1)

NOMBRE
Aguascalientes, Ags.           106.61
Calvillito, Ags.                14.50
Calvillo, Ags.                  10.20
Calvillo, Ags. SMN*             74.17
Cañada Honda, Ags.              34.50
Cincuenta Aniversario, Ags.     69.20
Cosio, Ags.                     36.50
Cosío, Ags.                      8.20
El Niagara, Ags.                26.40
Jocoque, Ags.                    7.30
La Codorniz, Ags.               66.70
Los Conos, Ags.                 64.70
Media Luna, Ags.                49.90
San Bartolo, Ags.               11.50
Name: ENE, dtype: float64

## Index Alignment in Data Frame

In [15]:
newRainSer2018 = pd.Series(rains2018.ENE[0:5])
newRainSer2018.index = rains2018.NOMBRE[0:5]
newRainSer2019 = pd.Series(rains2019.ENE[0:5])
newRainSer2019.index = rains2019.NOMBRE[0:5]

rainDf = pd.DataFrame({'2018': newRainSer2018, '2019': newRainSer2019})
rainDf

                             2018   2019
Aguascalientes, Ags.         25.8   6.61
Calvillo, Ags. SMN*          56.0  18.17
Cañada Honda, Ags.           17.2    NaN
Cincuenta Aniversario, Ags.  58.6  10.60
La Codorniz, Ags.            50.0  16.70
San Bartolo, Ags.             NaN  10.50

In [237]:
newRainSer2018, newRainSer2019

(NOMBRE
 Aguascalientes, Ags.           100.0
 Cincuenta Aniversario, Ags.     58.6
 Calvillo, Ags. SMN*             56.0
 La Codorniz, Ags.               50.0
 Cañada Honda, Ags.              17.2
 Name: ENE, dtype: float64, NOMBRE
 Aguascalientes, Ags.            6.61
 Cincuenta Aniversario, Ags.    10.60
 San Bartolo, Ags.              10.50
 Calvillo, Ags. SMN*            18.17
 La Codorniz, Ags.              16.70
 Name: ENE, dtype: float64)

In [241]:
newTempSer2018 = pd.Series(avgtemp2018.Tmed[0:5])
newTempSer2018.index = avgtemp2018.Est[0:5]

newTempSer2019 = pd.Series(avgtemp2019.Tmed[0:5])
newTempSer2019.index = avgtemp2018.Est[0:5]

tempDf = pd.DataFrame({'2019': newTempSer2019, '2018': newTempSer2018})
tempDf

                                          2019  2018
Est
ABASOLO                              27.441935  16.2
ABASOLO                              13.462069  15.0
ABELARDO L. RODRIGUEZ                28.088710  16.7
ACAJETE                           *  23.374074  12.3
ACALA                                17.987097  21.2

In [242]:
rainDf + tempDf

                                     2018  2019
ABASOLO                               NaN   NaN
ABASOLO                               NaN   NaN
ABELARDO L. RODRIGUEZ                 NaN   NaN
ACAJETE                           *   NaN   NaN
ACALA                                 NaN   NaN
Aguascalientes, Ags.                  NaN   NaN
Calvillo, Ags. SMN*                   NaN   NaN
Cañada Honda, Ags.                    NaN   NaN
Cincuenta Aniversario, Ags.           NaN   NaN
La Codorniz, Ags.                     NaN   NaN
San Bartolo, Ags.                     NaN   NaN

In [244]:
fill = rainDf.stack().mean()
rainDf.add(tempDf, fill_value = fill)

                                        2018       2019
ABASOLO                               50.638  61.879935
ABASOLO                               49.438  47.900069
ABELARDO L. RODRIGUEZ                 51.138  62.526710
ACAJETE                           *   46.738  57.812074
ACALA                                 55.638  52.425097
Aguascalientes, Ags.                 134.438  41.048000
Calvillo, Ags. SMN*                   90.438  52.608000
Cañada Honda, Ags.                    51.638        NaN
Cincuenta Aniversario, Ags.           93.038  45.038000
La Codorniz, Ags.                     84.438  51.138000
San Bartolo, Ags.                        NaN  44.938000

## Ufuncs: Operations between DataFrame and Series

In [245]:
A = rng.randint(10, size=(3, 4))
A

array([[2, 5, 1, 3],
       [9, 7, 7, 1],
       [1, 3, 2, 2]])

In [246]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 7,  2,  6, -2],
       [-1, -2,  1, -1]])

In [248]:
A - 2*A[1]

array([[-16,  -9, -13,   1],
       [ -9,  -7,  -7,  -1],
       [-17, -11, -12,   0]])

In [249]:
rainDf - rainDf.iloc[0]

                             2018   2019
Aguascalientes, Ags.          0.0   0.00
Calvillo, Ags. SMN*         -44.0  11.56
Cañada Honda, Ags.          -82.8    NaN
Cincuenta Aniversario, Ags. -41.4   3.99
La Codorniz, Ags.           -50.0  10.09
San Bartolo, Ags.             NaN   3.89

In [251]:
rainDf.sub(rainDf['2018'], axis = 0)

                             2018   2019
Aguascalientes, Ags.          0.0 -93.39
Calvillo, Ags. SMN*           0.0 -37.83
Cañada Honda, Ags.            0.0    NaN
Cincuenta Aniversario, Ags.   0.0 -48.00
La Codorniz, Ags.             0.0 -33.30
San Bartolo, Ags.             NaN    NaN

In [256]:
halfrow = rainDf.iloc[:1, ::2]
halfrow

2018    56.0
Name: Calvillo, Ags. SMN*, dtype: float64

# Handling Missing Data 
## Pythonic Missing Data

In [4]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [7]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
121 ms ± 1.62 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
4.4 ms ± 8.67 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [8]:
for dtype in ['object', 'int', 'float']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
121 ms ± 1.5 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
4.44 ms ± 15.5 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

dtype = float
8.04 ms ± 77.8 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

# NaN: Missing Numerical Data

In [16]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [10]:
1 + np.nan

nan

In [11]:
0 * np.nan

nan

In [17]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [18]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

# NaN and None in Pandas

In [3]:
pd.Series([1, 2, 3, np.nan])

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [10]:
ser = pd.Series(range(5), dtype = int)
ser

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [9]:
ser[0] = None
ser

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

# Operating on Null Values
## Detecting Null Values

In [16]:
rainDf.isnull()

                              2018   2019
Aguascalientes, Ags.         False  False
Calvillo, Ags. SMN*          False  False
Cañada Honda, Ags.           False   True
Cincuenta Aniversario, Ags.  False  False
La Codorniz, Ags.            False  False
San Bartolo, Ags.             True  False

In [17]:
rainDf.notnull()

                              2018   2019
Aguascalientes, Ags.          True   True
Calvillo, Ags. SMN*           True   True
Cañada Honda, Ags.            True  False
Cincuenta Aniversario, Ags.   True   True
La Codorniz, Ags.             True   True
San Bartolo, Ags.            False   True

In [19]:
rainDf[rainDf.notnull()]

                             2018   2019
Aguascalientes, Ags.         25.8   6.61
Calvillo, Ags. SMN*          56.0  18.17
Cañada Honda, Ags.           17.2    NaN
Cincuenta Aniversario, Ags.  58.6  10.60
La Codorniz, Ags.            50.0  16.70
San Bartolo, Ags.             NaN  10.50

# Dropping null values

In [24]:
rainDf

                             2018   2019
Aguascalientes, Ags.         25.8   6.61
Calvillo, Ags. SMN*          56.0  18.17
Cañada Honda, Ags.           17.2    NaN
Cincuenta Aniversario, Ags.  58.6  10.60
La Codorniz, Ags.            50.0  16.70
San Bartolo, Ags.             NaN  10.50

In [20]:
rainDf.dropna()

                             2018   2019
Aguascalientes, Ags.         25.8   6.61
Calvillo, Ags. SMN*          56.0  18.17
Cincuenta Aniversario, Ags.  58.6  10.60
La Codorniz, Ags.            50.0  16.70

In [23]:
rainDf.dropna(axis = 'columns')

Empty DataFrame
Columns: []
Index: [Aguascalientes, Ags., Calvillo, Ags. SMN*, Cañada Honda, Ags., Cincuenta Aniversario, Ags., La Codorniz, Ags., San Bartolo, Ags.]

In [25]:
rainDf.dropna(axis = 'rows')

                             2018   2019
Aguascalientes, Ags.         25.8   6.61
Calvillo, Ags. SMN*          56.0  18.17
Cincuenta Aniversario, Ags.  58.6  10.60
La Codorniz, Ags.            50.0  16.70

In [30]:
rainDf['2020'] = np.nan
rainDf

                             2018   2019   3  2020
Aguascalientes, Ags.         25.8   6.61 NaN   NaN
Calvillo, Ags. SMN*          56.0  18.17 NaN   NaN
Cañada Honda, Ags.           17.2    NaN NaN   NaN
Cincuenta Aniversario, Ags.  58.6  10.60 NaN   NaN
La Codorniz, Ags.            50.0  16.70 NaN   NaN
San Bartolo, Ags.             NaN  10.50 NaN   NaN

In [31]:
rainDf.dropna(axis = 'columns', how = 'all')

                             2018   2019
Aguascalientes, Ags.         25.8   6.61
Calvillo, Ags. SMN*          56.0  18.17
Cañada Honda, Ags.           17.2    NaN
Cincuenta Aniversario, Ags.  58.6  10.60
La Codorniz, Ags.            50.0  16.70
San Bartolo, Ags.             NaN  10.50

In [32]:
rainDf.dropna(axis = 'rows', thresh = 1)

                             2018   2019   3  2020
Aguascalientes, Ags.         25.8   6.61 NaN   NaN
Calvillo, Ags. SMN*          56.0  18.17 NaN   NaN
Cañada Honda, Ags.           17.2    NaN NaN   NaN
Cincuenta Aniversario, Ags.  58.6  10.60 NaN   NaN
La Codorniz, Ags.            50.0  16.70 NaN   NaN
San Bartolo, Ags.             NaN  10.50 NaN   NaN

In [33]:
rainDf.dropna(axis = 'rows', thresh = 2)

                             2018   2019   3  2020
Aguascalientes, Ags.         25.8   6.61 NaN   NaN
Calvillo, Ags. SMN*          56.0  18.17 NaN   NaN
Cincuenta Aniversario, Ags.  58.6  10.60 NaN   NaN
La Codorniz, Ags.            50.0  16.70 NaN   NaN

In [34]:
rainDf.dropna(axis = 'rows', thresh = 3)

Empty DataFrame
Columns: [2018, 2019, 3, 2020]
Index: []

## Filling null values

In [43]:
rainSer2018 = pd.Series(rains2018.ENE[15:23])
rainSer2018.index = rains2018.NOMBRE[15:23]
rainSer2018

NOMBRE
Puerto de la Concepción, Ags.    26.7
Potrerillos, Ags.                52.8
Sandovales, Ags.                  8.0
La Tinaja II, Ags.               10.0
Villa Juárez, Ags.               16.9
OBSERVATORIO DE ALGODONES SMN     1.4
Abelardo L. Rodríguez, B.C.      53.6
Cataviña, B.C. SMN*               0.5
Name: ENE, dtype: float64

In [47]:
rainSer2018[0] = np.nan
rainSer2018[3] = np.nan
rainSer2018[5] = np.nan
rainSer2018

NOMBRE
Puerto de la Concepción, Ags.     NaN
Potrerillos, Ags.                52.8
Sandovales, Ags.                  8.0
La Tinaja II, Ags.                NaN
Villa Juárez, Ags.               16.9
OBSERVATORIO DE ALGODONES SMN     NaN
Abelardo L. Rodríguez, B.C.      53.6
Cataviña, B.C. SMN*               0.5
Name: ENE, dtype: float64

In [48]:
rainSer2018.fillna(0)

NOMBRE
Puerto de la Concepción, Ags.     0.0
Potrerillos, Ags.                52.8
Sandovales, Ags.                  8.0
La Tinaja II, Ags.                0.0
Villa Juárez, Ags.               16.9
OBSERVATORIO DE ALGODONES SMN     0.0
Abelardo L. Rodríguez, B.C.      53.6
Cataviña, B.C. SMN*               0.5
Name: ENE, dtype: float64

In [49]:
rainSer2018.fillna(10)

NOMBRE
Puerto de la Concepción, Ags.    10.0
Potrerillos, Ags.                52.8
Sandovales, Ags.                  8.0
La Tinaja II, Ags.               10.0
Villa Juárez, Ags.               16.9
OBSERVATORIO DE ALGODONES SMN    10.0
Abelardo L. Rodríguez, B.C.      53.6
Cataviña, B.C. SMN*               0.5
Name: ENE, dtype: float64

In [51]:
rainSer2018.fillna(method = 'ffill')

NOMBRE
Puerto de la Concepción, Ags.     NaN
Potrerillos, Ags.                52.8
Sandovales, Ags.                  8.0
La Tinaja II, Ags.                8.0
Villa Juárez, Ags.               16.9
OBSERVATORIO DE ALGODONES SMN    16.9
Abelardo L. Rodríguez, B.C.      53.6
Cataviña, B.C. SMN*               0.5
Name: ENE, dtype: float64

In [52]:
rainSer2018.fillna(method = 'bfill')

NOMBRE
Puerto de la Concepción, Ags.    52.8
Potrerillos, Ags.                52.8
Sandovales, Ags.                  8.0
La Tinaja II, Ags.               16.9
Villa Juárez, Ags.               16.9
OBSERVATORIO DE ALGODONES SMN    53.6
Abelardo L. Rodríguez, B.C.      53.6
Cataviña, B.C. SMN*               0.5
Name: ENE, dtype: float64

In [53]:
rainDf

                             2018   2019   3  2020
Aguascalientes, Ags.         25.8   6.61 NaN   NaN
Calvillo, Ags. SMN*          56.0  18.17 NaN   NaN
Cañada Honda, Ags.           17.2    NaN NaN   NaN
Cincuenta Aniversario, Ags.  58.6  10.60 NaN   NaN
La Codorniz, Ags.            50.0  16.70 NaN   NaN
San Bartolo, Ags.             NaN  10.50 NaN   NaN

In [54]:
rainDf.fillna(method = 'ffill', axis = 1)

                             2018   2019      3   2020
Aguascalientes, Ags.         25.8   6.61   6.61   6.61
Calvillo, Ags. SMN*          56.0  18.17  18.17  18.17
Cañada Honda, Ags.           17.2  17.20  17.20  17.20
Cincuenta Aniversario, Ags.  58.6  10.60  10.60  10.60
La Codorniz, Ags.            50.0  16.70  16.70  16.70
San Bartolo, Ags.             NaN  10.50  10.50  10.50

# Hierarchical Indexing

In [15]:
#Nueva lectura de archivos para empezar con ellos desde 0.
avgtemp8 = pd.read_csv('avgtemp2018.csv', usecols = (4,5), encoding='latin-1')
rains8 = pd.read_csv('rain2018.csv', usecols = (4,5), encoding='latin-1')

avgtemp9 = pd.read_csv('avgtemp2019.csv', usecols = (4,5), encoding='latin-1')
rains9 = pd.read_csv('rain2019.csv', usecols = (4,5), encoding='latin-1')

## A Multiply Indexed Series

### The bad way

In [8]:
index = [('Guanajuato', 2000), ('Guanajuato', 2010),
         ('León', 2000), ('León', 2010),
         ('Silao', 2000), ('Silao', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index = index)
pop

(Guanajuato, 2000)    33871648
(Guanajuato, 2010)    37253956
(León, 2000)          18976457
(León, 2010)          19378102
(Silao, 2000)         20851820
(Silao, 2010)         25145561
dtype: int64

In [9]:
pop[('Guanajuato', 2010):('Silao', 2000)]

(Guanajuato, 2010)    37253956
(León, 2000)          18976457
(León, 2010)          19378102
(Silao, 2000)         20851820
dtype: int64

In [10]:
pop[[i for i in pop.index if i[1] == 2010]]

(Guanajuato, 2010)    37253956
(León, 2010)          19378102
(Silao, 2010)         25145561
dtype: int64

### The Better Way: Pandas MultiIndex

In [24]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('Guanajuato', 2000),
            ('Guanajuato', 2010),
            (      'León', 2000),
            (      'León', 2010),
            (     'Silao', 2000),
            (     'Silao', 2010)],
           )

In [26]:
pop = pop.reindex(index)
pop

Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
Silao       2000    20851820
            2010    25145561
dtype: int64

In [27]:
pop[:, 2010]

Guanajuato    37253956
León          19378102
Silao         25145561
dtype: int64

In [31]:
pop[:, 2000]

Guanajuato    33871648
León          18976457
Silao         20851820
dtype: int64

## MultiIndex as Extra Dimension

In [33]:
pop_df = pop.unstack()
pop_df

                2000      2010
Guanajuato  33871648  37253956
León        18976457  19378102
Silao       20851820  25145561

In [34]:
pop_df.stack()

Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
Silao       2000    20851820
            2010    25145561
dtype: int64

In [36]:
pop_df = pd.DataFrame({'Total': pop,
                       'Menores de 18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    Total  Menores de 18
Guanajuato 2000  33871648        9267089
           2010  37253956        9284094
León       2000  18976457        4687374
           2010  19378102        4318033
Silao      2000  20851820        5906301
           2010  25145561        6879014

In [40]:
f_u18 = pop_df['Menores de 18'] / pop_df['Total']
f_u18.unstack()

                2000      2010
Guanajuato  0.273594  0.249211
León        0.247010  0.222831
Silao       0.283251  0.273568

# Methods of MultiIndex Creation

In [48]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['Data 1', 'Data 2'])
df

       Data 1    Data 2
a 1  0.504889  0.987323
  2  0.044104  0.976429
b 1  0.382337  0.697497
  2  0.620164  0.503381

In [53]:
data = {('Guanajuato', 2000): 33871648,
        ('Guanajuato', 2010): 37253956,
        ('León', 2000): 20851820,
        ('León', 2010): 25145561,
        ('Silao', 2000): 18976457,
        ('Silao', 2010): 19378102}
pd.Series(data)

Guanajuato  2000    33871648
            2010    37253956
León        2000    20851820
            2010    25145561
Silao       2000    18976457
            2010    19378102
dtype: int64

## Explicit MultiIndex Constructors

In [54]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [55]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [57]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [58]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [59]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [61]:
pd.MultiIndex(levels = [['a', 'b'], [1, 2]], codes = [[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

## MultiIndex level names

In [62]:
pop

Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
Silao       2000    20851820
            2010    25145561
dtype: int64

In [64]:
pop.index.names = ('Estado', 'Año')
pop

Estado      Año
Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
Silao       2000    20851820
            2010    25145561
dtype: int64

## MultiIndex for columns

In [66]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      25.0  36.6  19.0  37.1  33.0  37.6
     2      27.0  37.9  53.0  37.0  33.0  39.3
2014 1      34.0  37.4  43.0  37.3  36.0  36.6
     2      36.0  37.3  41.0  35.7  44.0  37.9

In [67]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      19.0  37.1
     2      53.0  37.0
2014 1      43.0  37.3
     2      41.0  35.7

# Indexing and Slicing a MultiIndex
## Multiply indexed Series

In [68]:
pop

Estado      Año
Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
Silao       2000    20851820
            2010    25145561
dtype: int64

In [69]:
pop['Guanajuato', 2000]

33871648

In [71]:
pop['Guanajuato', 2010]

37253956

In [72]:
pop.loc['Guanajuato':'León']

Estado      Año
Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
dtype: int64

In [73]:
pop[:, 2000]

Estado
Guanajuato    33871648
León          18976457
Silao         20851820
dtype: int64

In [74]:
pop[pop > 22000000]

Estado      Año
Guanajuato  2000    33871648
            2010    37253956
Silao       2010    25145561
dtype: int64

In [75]:
pop[['Guanajuato', 'Silao']]

Estado      Año
Guanajuato  2000    33871648
            2010    37253956
Silao       2000    20851820
            2010    25145561
dtype: int64

In [77]:
pop[['Silao', 'León']]

Estado  Año
León    2000    18976457
        2010    19378102
Silao   2000    20851820
        2010    25145561
dtype: int64

# Multiply Indexed DataFrames

In [78]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      25.0  36.6  19.0  37.1  33.0  37.6
     2      27.0  37.9  53.0  37.0  33.0  39.3
2014 1      34.0  37.4  43.0  37.3  36.0  36.6
     2      36.0  37.3  41.0  35.7  44.0  37.9

In [79]:
health_data['Guido', 'HR']

year  visit
2013  1        19.0
      2        53.0
2014  1        43.0
      2        41.0
Name: (Guido, HR), dtype: float64

In [80]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      25.0  36.6
     2      27.0  37.9

In [82]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        25.0
      2        27.0
2014  1        34.0
      2        36.0
Name: (Bob, HR), dtype: float64

In [84]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      25.0  19.0  33.0
2014 1      34.0  43.0  36.0

# Rearranging Multi-Indices

## Sorted and unsorted indices

In [92]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.965846
      2      0.933467
c     1      0.106248
      2      0.660888
b     1      0.146728
      2      0.418799
dtype: float64

# try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

In [94]:
data = data.sort_index()
data

char  int
a     1      0.965846
      2      0.933467
b     1      0.146728
      2      0.418799
c     1      0.106248
      2      0.660888
dtype: float64

In [95]:
data['a':'b']

char  int
a     1      0.965846
      2      0.933467
b     1      0.146728
      2      0.418799
dtype: float64

# Stacking and unstacking indices

In [96]:
pop.unstack(level=0)

Estado  Guanajuato      León     Silao
Año
2000      33871648  18976457  20851820
2010      37253956  19378102  25145561

In [98]:
pop.unstack(level=1)

Año             2000      2010
Estado
Guanajuato  33871648  37253956
León        18976457  19378102
Silao       20851820  25145561

In [99]:
pop.unstack().stack()

Estado      Año
Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
Silao       2000    20851820
            2010    25145561
dtype: int64

In [100]:
pop

Estado      Año
Guanajuato  2000    33871648
            2010    37253956
León        2000    18976457
            2010    19378102
Silao       2000    20851820
            2010    25145561
dtype: int64

# Index setting and resetting

In [101]:
pop_flat = pop.reset_index()
pop_flat

       Estado   Año         0
0  Guanajuato  2000  33871648
1  Guanajuato  2010  37253956
2        León  2000  18976457
3        León  2010  19378102
4       Silao  2000  20851820
5       Silao  2010  25145561

In [103]:
pop_flat = pop.reset_index(name='Población')
pop_flat

       Estado   Año  Población
0  Guanajuato  2000   33871648
1  Guanajuato  2010   37253956
2        León  2000   18976457
3        León  2010   19378102
4       Silao  2000   20851820
5       Silao  2010   25145561

In [105]:
pop_flat.set_index(['Estado', 'Año'])

                 Población
Estado     Año
Guanajuato 2000   33871648
           2010   37253956
León       2000   18976457
           2010   19378102
Silao      2000   20851820
           2010   25145561

# Data Aggregation on Multi-Indices

In [106]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      25.0  36.6  19.0  37.1  33.0  37.6
     2      27.0  37.9  53.0  37.0  33.0  39.3
2014 1      34.0  37.4  43.0  37.3  36.0  36.6
     2      36.0  37.3  41.0  35.7  44.0  37.9

In [108]:
data_mean = health_data.mean(level = 'year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     26.0  37.25  36.0  37.05  33.0  38.45
2014     35.0  37.35  42.0  36.50  40.0  37.25

In [109]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  31.666667  37.583333
2014  39.000000  37.033333

# Combining Datasets: Concant and Append

In [110]:
import pandas as pd
import numpy as np

In [111]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [112]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

# Recall: Concatenation of NumPy Arrays

In [113]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [115]:
x = [[1, 2],
     [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

## Simple Concatenation with pd.concat()

In [121]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [122]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [129]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis=1)")

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis=1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [132]:
df3 = make_df('AB', [1, 0])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis=1)")

df3
    A   B
1  A1  B1
0  A0  B0

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis=1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

## Duplicate Indices

In [133]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # make duplicate indices!
display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

### Catching the repeats as an error

In [135]:
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

### Ignoring the index

In [136]:
display('x', 'y', 'pd.concat([x, y], ignore_index=True)')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], ignore_index=True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

### Adding MultiIndex Keys

In [138]:
display('x', 'y', "pd.concat([x, y], keys=['x', 'y'])")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], keys=['x', 'y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

## Concatenation with joins

In [143]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6', 'pd.concat([df5, df6])')

C:\Users\52477\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [145]:
display('df5', 'df6', "pd.concat([df5, df6], join='inner')")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [146]:
display('df5', 'df6',
        "pd.concat([df5, df6], join_axes=[df5.columns])")

C:\Users\52477\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join_axes=[df5.columns])
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

## The .append() method

In [147]:
display('df1', 'df2', 'df1.append(df2)')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

df1.append(df2)
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

# Combining Datasets: Merge and Join

In [1]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

## Relational Algebra: Categories of Joins
### One-to-one Joins

In [40]:
rainSer8 = pd.Series(rains2018.ENE[0:15])
rainSer8.index = rains2018.NOMBRE[0:15]

rainSer9 = pd.Series(rains2019.ENE[0:15])
rainSer9.index = rains2018.NOMBRE[0:15]

rainDf = pd.DataFrame({'LL 2018': rainSer8, '2019': rainSer9})
rainDf

                                 LL 2018   2019
NOMBRE
Aguascalientes, Ags.                25.8   6.61
Cincuenta Aniversario, Ags.         58.6  10.60
Calvillo, Ags. SMN*                 56.0  10.50
La Codorniz, Ags.                   50.0  18.17
Cañada Honda, Ags.                  17.2  16.70
Calvillito, Ags.                    13.5  17.30
Los Conos, Ags.                     51.5   9.20
Cosio, Ags.                         35.5  13.20
Media Luna, Ags.                    48.9   7.20
El Niagara, Ags.                    25.4   6.30
Observatorio, Ags.                  20.9  24.30
Presa 50 Aniversario, Ags. SMN*     57.2   5.51
Palo Alto, Ags.                     19.0  15.50
Pabellón, Ags.                      22.0   8.71
Calles, Ags.                        50.0  10.40

In [41]:
avgTempSer8 = pd.Series(avgtemp2018.Tmed[0:15])
avgTempSer8.index = rains2018.NOMBRE[0:15]

avgTempSer9 = pd.Series(avgtemp2019.Tmed[0:15])
avgTempSer9.index = rains2018.NOMBRE[0:15]

avgTempDf = pd.DataFrame({'AT 2018': avgTempSer8, '2019': avgTempSer9})
avgTempDf

                                 AT 2018       2019
NOMBRE
Aguascalientes, Ags.                16.2  27.441935
Cincuenta Aniversario, Ags.         15.0  13.462069
Calvillo, Ags. SMN*                 16.7  28.088710
La Codorniz, Ags.                   12.3  23.374074
Cañada Honda, Ags.                  21.2  17.987097
Calvillito, Ags.                    15.0  14.730357
Los Conos, Ags.                     27.2  16.614000
Cosio, Ags.                         25.4  15.850000
Media Luna, Ags.                    12.8  24.151613
El Niagara, Ags.                    12.8  11.682258
Observatorio, Ags.                  14.8  16.250000
Presa 50 Aniversario, Ags. SMN*     13.3  23.260000
Palo Alto, Ags.                     20.0  17.741935
Pabellón, Ags.                      20.1  18.038889
Calles, Ags.                        21.3  14.440323

In [42]:
display('rainDf', 'avgTempDf')

rainDf
                                 LL 2018   2019
NOMBRE
Aguascalientes, Ags.                25.8   6.61
Cincuenta Aniversario, Ags.         58.6  10.60
Calvillo, Ags. SMN*                 56.0  10.50
La Codorniz, Ags.                   50.0  18.17
Cañada Honda, Ags.                  17.2  16.70
Calvillito, Ags.                    13.5  17.30
Los Conos, Ags.                     51.5   9.20
Cosio, Ags.                         35.5  13.20
Media Luna, Ags.                    48.9   7.20
El Niagara, Ags.                    25.4   6.30
Observatorio, Ags.                  20.9  24.30
Presa 50 Aniversario, Ags. SMN*     57.2   5.51
Palo Alto, Ags.                     19.0  15.50
Pabellón, Ags.                      22.0   8.71
Calles, Ags.                        50.0  10.40

avgTempDf
                                 AT 2018       2019
NOMBRE
Aguascalientes, Ags.                16.2  27.441935
Cincuenta Aniversario, Ags.         15.0  13.462069
Calvillo, Ags. SMN*                 16.7  28.088710
La Codorniz, Ags.                   12.3  23.374074
Cañada Honda, Ags.                  21.2  17.987097
Calvillito, Ags.                    15.0  14.730357
Los Conos, Ags.                     27.2  16.614000
Cosio, Ags.                         25.4  15.850000
Media Luna, Ags.                    12.8  24.151613
El Niagara, Ags.                    12.8  11.682258
Observatorio, Ags.                  14.8  16.250000
Presa 50 Aniversario, Ags. SMN*     13.3  23.260000
Palo Alto, Ags.                     20.0  17.741935
Pabellón, Ags.                      20.1  18.038889
Calles, Ags.                        21.3  14.440323

In [48]:
display('rainDf', 'avgTempDf', "pd.merge(rainDf, avgTempDf, on='2019')")

rainDf
                                 LL 2018   2019
NOMBRE
Aguascalientes, Ags.                25.8   6.61
Cincuenta Aniversario, Ags.         58.6  10.60
Calvillo, Ags. SMN*                 56.0  10.50
La Codorniz, Ags.                   50.0  18.17
Cañada Honda, Ags.                  17.2  16.70
Calvillito, Ags.                    13.5  17.30
Los Conos, Ags.                     51.5   9.20
Cosio, Ags.                         35.5  13.20
Media Luna, Ags.                    48.9   7.20
El Niagara, Ags.                    25.4   6.30
Observatorio, Ags.                  20.9  24.30
Presa 50 Aniversario, Ags. SMN*     57.2   5.51
Palo Alto, Ags.                     19.0  15.50
Pabellón, Ags.                      22.0   8.71
Calles, Ags.                        50.0  10.40

avgTempDf
                                 AT 2018       2019
NOMBRE
Aguascalientes, Ags.                16.2  27.441935
Cincuenta Aniversario, Ags.         15.0  13.462069
Calvillo, Ags. SMN*                 16.7  28.088710
La Codorniz, Ags.                   12.3  23.374074
Cañada Honda, Ags.                  21.2  17.987097
Calvillito, Ags.                    15.0  14.730357
Los Conos, Ags.                     27.2  16.614000
Cosio, Ags.                         25.4  15.850000
Media Luna, Ags.                    12.8  24.151613
El Niagara, Ags.                    12.8  11.682258
Observatorio, Ags.                  14.8  16.250000
Presa 50 Aniversario, Ags. SMN*     13.3  23.260000
Palo Alto, Ags.                     20.0  17.741935
Pabellón, Ags.                      20.1  18.038889
Calles, Ags.                        21.3  14.440323

pd.merge(rainDf, avgTempDf, on='2019')
Empty DataFrame
Columns: [LL 2018, 2019, AT 2018]
Index: []